Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/Роли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>Роли</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завуч</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Преподаватель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтуденческийОтдел</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос=Новый Запрос;
	Запрос.Текст= "
	|ВЫБРАТЬ
	|	Пользователи.Логин КАК Логин,
	|	Пользователи.УникальныйИдентификатор КАК УникальныйИдентификатор
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Объект.Логин);
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Если Результат.Количество() = 0 ИЛИ ТекущийОбъект.УникальныйИдентификатор = Результат.УникальныйИдентификатор Тогда
			ПользовательСсылка = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.УникальныйИдентификатор);
			Если ПользовательСсылка = Неопределено Тогда
				НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
				НовыйПользователь.Имя = Объект.Логин;
				НовыйПользователь.Пароль = Объект.Пароль;
				НовыйПользователь.ПолноеИмя = Объект.Наименование;
				
				Если Объект.Роль = Перечисления.Роли.Администратор Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
				ИначеЕсли Объект.Роль = Перечисления.Роли.Администрация Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администрация);
				ИначеЕсли Объект.Роль = Перечисления.Роли.Завуч Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Завуч);
				ИначеЕсли Объект.Роль = Перечисления.Роли.Методист Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Методист);
				ИначеЕсли Объект.Роль = Перечисления.Роли.Преподаватель Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Преподаватель);
				ИначеЕсли Объект.Роль = Перечисления.Роли.СтуденческийОтдел Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.СтуденческийОтдел);
				КонецЕсли;
				
				НовыйПользователь.ПоказыватьВСпискеВыбора = Ложь;
				
				НовыйПользователь.Записать();
				ТекущийОбъект.УникальныйИдентификатор=НовыйПользователь.УникальныйИдентификатор;
			Иначе
				ПользовательСсылка.Пароль=Объект.Пароль;
				ПользовательСсылка.ПолноеИмя=Объект.Наименование;
				ПользовательСсылка.Роли.Очистить();
				Если Объект.Роль=Перечисления.Роли.Администратор Тогда
					ПользовательСсылка.Роли.Добавить(Метаданные.Роли.Администратор);
				ИначеЕсли Объект.Роль=Перечисления.Роли.Администрация Тогда
					ПользовательСсылка.Роли.Добавить(Метаданные.Роли.Администрация);
				ИначеЕсли Объект.Роль=Перечисления.Роли.Завуч Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Завуч);
				ИначеЕсли Объект.Роль=Перечисления.Роли.Методист Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Методист);
				ИначеЕсли Объект.Роль=Перечисления.Роли.Преподаватель Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Преподаватель);
				ИначеЕсли Объект.Роль=Перечисления.Роли.СтуденческийОтдел Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.СтуденческийОтдел);
				КонецЕсли;
				
				ПользовательСсылка.Записать();
			КонецЕсли;
		Иначе
			Сообщ=Новый СообщениеПользователю;
			Сообщ.Текст="Пользователь с таким логином уже существует!";
			Сообщ.Сообщить();
			Отказ=Истина;
		КонецЕсли;
	Иначе
		НовыйПользователь=ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя=Объект.Логин;
		НовыйПользователь.Пароль=Объект.Пароль;
		НовыйПользователь.ПолноеИмя=Объект.Наименование; 
		Если Объект.Роль=Перечисления.Роли.Администратор Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
		ИначеЕсли Объект.Роль=Перечисления.Роли.Администрация Тогда
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администрация);
		ИначеЕсли Объект.Роль=Перечисления.Роли.Завуч Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Завуч);
		ИначеЕсли Объект.Роль=Перечисления.Роли.Методист Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Методист); 
		ИначеЕсли Объект.Роль=Перечисления.Роли.Преподаватель Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Преподаватель);
		ИначеЕсли Объект.Роль=Перечисления.Роли.СтуденческийОтдел Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.СтуденческийОтдел);
		КонецЕсли;
		
		НовыйПользователь.ПоказыватьВСпискеВыбора=Ложь;

		НовыйПользователь.Записать();
		ТекущийОбъект.УникальныйИдентификатор=НовыйПользователь.УникальныйИдентификатор;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователя(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Ответ = Вопрос("Вы уверены, что хотите удалить пользователя " + Объект.Наименование 
		+ "?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Внимание");
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			УдалитьПоИдентификатору();
			ЭтотОбъект.Закрыть();
			Сообщить("Пользователь ИБ удален. Не забудьте поставить отметку об удалении.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьПоИдентификатору()
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.УникальныйИдентификатор);
	ПользовательИБ.Удалить();
КонецПроцедуры
